Revit 2021.1 API
MultiServerService Methods
The MultiServerService type exposes the following members.
Methods
Name | Description
AddServer
 Registers a server with its service.
 (Inherited from ExternalService.)
Dispose |  (Inherited from ExternalService.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetActiveServerIds()
 Returns Ids of the currently active application-level servers registered for the service.
GetActiveServerIds(Document)
 Returns Ids of the servers currently applicable to the given document for the service.
GetDefaultServerId
 Returns the Id of the default server if one was assigned to the service.
 (Inherited from ExternalService.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetOptions
 A copy of the options the service was registered with.
 (Inherited from ExternalService.)
GetPublicAccessKey
 Access key to use to execute a service.
 (Inherited from ExternalService.)
GetRegisteredServerIds
 Returns Ids of all servers registered for the service.
 (Inherited from ExternalService.)
GetServer
 Returns the instance that provides implementation for a registered server.
 (Inherited from ExternalService.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsRegisteredServerId
 Checks if the Id represents a valid server that has been registered for the service.
 (Inherited from ExternalService.)
RemoveServer
 Removes/unregisters a server from the service.
 (Inherited from ExternalService.)
SetActiveServers(IList<Guid>)
 Changes the active servers and/or their order.
SetActiveServers(IList<Guid>, Document)
 Changes the active servers and/or their order for the given document.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
MultiServerService Class
Autodesk.Revit.DB.ExternalService Namespace